skomaragiri/Microcontroller-projects-PIC18F4620/Lab8/lab8p1.c
void Deactivate_Buzzer()
{
 CCP2CON = 0x0;
 PORTBbits.RB3 = 0;
}

void PED_Control( char direction, char Num_Sec)
{
    for(char i = Num_Sec-1;i>0; i--)
    {
        update_LCD_PED_Count(direction, i);
        Wait_One_Second_With_Beep();            // hold the number on 7-Segment for 1 second
    }
    
    update_LCD_PED_Count(direction, 0);         //
    Wait_One_Second_With_Beep();                // leaves the 7-Segment off for 1 second
}

void Day_Mode()
{
    MODE = 1;                                   // turns on the MODE_LED
    MODE_LED = 1;
    Act_Mode_Txt[0] = 'D';
    
    Set_NS(GREEN); 
    Set_NS_LT(RED); 
    Set_EW_LT(RED); 
    Set_EW(RED); 
    
    if(NS_PED_SW == 1)
    {
        PED_Control(NS, 6);
    }
    Wait_N_Seconds(NS, 9);
    Set_NS(YELLOW); 
    Wait_N_Seconds(NS, 3);
    Set_NS(RED);
    if(EW_LT_SW == 1)
    {
        Set_EW_LT(GREEN);
        Wait_N_Seconds(EWLT, 6);
        Set_EW_LT(YELLOW);
        Wait_N_Seconds(EWLT, 3);
        Set_EW_LT(RED);
    }
    Set_EW(GREEN);
    if(EW_PED_SW == 1)
    {
        PED_Control(EW, 9);
    }
    Wait_N_Seconds(EW, 7);
    Set_EW(YELLOW);
    Wait_N_Seconds(EW, 3);
    Set_EW(RED);
    if(NS_LT_SW == 1)
    {
        Set_NS_LT(GREEN);
        Wait_N_Seconds(NSLT, 6);
        Set_NS_LT(YELLOW);
        Wait_N_Seconds(NSLT, 3);
        Set_NS_LT(RED);
    } 
}
void Night_Mode()
{ 
    MODE = 0;                                   // turns on the MODE_LED
    MODE_LED = 0;
    Act_Mode_Txt[0] = 'N';
    
    Set_NS(GREEN);
    Set_NS_LT(RED);              // Step 1
    Set_EW(RED);
    Set_EW_LT(RED);
    
    
    Wait_N_Seconds(NS, 8);          // Step 2   
    
    Set_NS(YELLOW);             // Step 3  
    Wait_N_Seconds(NS, 3);
    
    Set_NS(RED);                // Step 4
    
    if(EW_LT_SW == 1)            // Step 5 
    {
        Set_EW_LT(GREEN);        // Step 6 
        Wait_N_Seconds(EWLT, 6);
        
        Set_EW_LT(YELLOW);       // Step 7
        Wait_N_Seconds(EWLT, 3);
        
        Set_EW_LT(RED);         // Step 8
    }
    
    Set_EW(GREEN);             // Step 9 
    Wait_N_Seconds(EW, 8);
    
    Set_EW(YELLOW);            // Step 10
    Wait_N_Seconds(EW, 3);
    
    Set_EW(RED);               // Step 11
    
    if (NS_LT_SW==1)            // Step 12
    {
        Set_NS_LT(GREEN);       // Step 13
        Wait_N_Seconds(NSLT, 6);
    
        Set_NS_LT(YELLOW);      // Step 14
        Wait_N_Seconds(NSLT, 3);
    
        Set_NS_LT(RED);         // Step 15    
    }

}

void Old_Wait_One_Second()                      //creates one second delay and blinking asterisk
{
    SEC_LED = 1;
    Wait_Half_Second();                         // Wait for half second (or 500 msec)
    SEC_LED = 0;
    Wait_Half_Second();                         // Wait for half second (or 500 msec)

}

void Wait_One_Second()				// creates one second delay and blinking asterisk
{
    SEC_LED = 1;
    strcpy(txt,"*");
    drawtext(120,10,txt,ST7735_WHITE,ST7735_BLACK,TS_1);
    Wait_Half_Second();                         // Wait for half second (or 500 msec)

    SEC_LED = 0;
    strcpy(txt," ");
    drawtext(120,10,txt,ST7735_WHITE,ST7735_BLACK,TS_1);
    Wait_Half_Second();                         // Wait for half second (or 500 msec)
    update_LCD_misc();
}

void Wait_One_Second_With_Beep()		// creates one second delay as well as sound buzzer
{
    SEC_LED = 1; // First, turn on the SEC LED
    Activate_Buzzer(); // Activate the buzzer
    Wait_Half_Second(); // Wait for half second (or 500 msec)
    SEC_LED = 0; // then turn off the SEC LED
    Deactivate_Buzzer (); // Deactivate the buzzer
    Wait_Half_Second(); // Wait for half second (or 500 msec)
    update_LCD_misc();
}
    
void Wait_Half_Second()
{
    T0CON = 0x03;                               // Timer 0, 16-bit mode, prescaler 1:16
    TMR0L = 0xDB;                               // set the lower byte of TMR
    TMR0H = 0x0B;                               // set the upper byte of TMR
    INTCONbits.TMR0IF = 0;                      // clear the Timer 0 flag
    T0CONbits.TMR0ON = 1;                       // Turn on the Timer 0
    while (INTCONbits.TMR0IF == 0);             // wait for the Timer Flag to be 1 for done
    T0CONbits.TMR0ON = 0;                       // turn off the Timer 0
}

void Wait_N_Seconds (char direction, char seconds)
{
    char I;
    for (I = seconds; I> 0; I--)
    {
        update_LCD_count(direction, I); 
        Wait_One_Second();                      // calls Wait_One_Second for x number of times       
    }
    update_LCD_count(direction, 0);   
}

void update_LCD_color(char direction, char color)
{
    char Circle_Y;
    Circle_Y = NS_Cir_Y + direction * 30;    
    
    if (color == Color_Off)     //if Color off make all circles black but leave outline
    {
            fillCircle(XRED, Circle_Y, Circle_Size, ST7735_BLACK);
            fillCircle(XYEL, Circle_Y, Circle_Size, ST7735_BLACK);
            fillCircle(XGRN, Circle_Y, Circle_Size, ST7735_BLACK); 
            drawCircle(XRED, Circle_Y, Circle_Size, ST7735_RED);            
            drawCircle(XYEL, Circle_Y, Circle_Size, ST7735_YELLOW);
            drawCircle(XGRN, Circle_Y, Circle_Size, ST7735_GREEN);                       
    }    
    
    if (color == Color_Red)     //if the color is red only fill the red circle with red
    {
            fillCircle(XRED, Circle_Y, Circle_Size, ST7735_RED);
            fillCircle(XYEL, Circle_Y, Circle_Size, ST7735_BLACK);
            fillCircle(XGRN, Circle_Y, Circle_Size, ST7735_BLACK); 
            drawCircle(XRED, Circle_Y, Circle_Size, ST7735_RED);            
            drawCircle(XYEL, Circle_Y, Circle_Size, ST7735_YELLOW);
            drawCircle(XGRN, Circle_Y, Circle_Size, ST7735_GREEN);  
    }
          
    // put code here
    if (color == Color_Green)     //if the color is red only fill the red circle with red
    {
            fillCircle(XRED, Circle_Y, Circle_Size, ST7735_BLACK);
            fillCircle(XYEL, Circle_Y, Circle_Size, ST7735_BLACK);
            fillCircle(XGRN, Circle_Y, Circle_Size, ST7735_GREEN); 
            drawCircle(XRED, Circle_Y, Circle_Size, ST7735_RED);            
            drawCircle(XYEL, Circle_Y, Circle_Size, ST7735_YELLOW);
            drawCircle(XGRN, Circle_Y, Circle_Size, ST7735_GREEN);  
    }
    
    if (color == Color_Yellow)     //if the color is red only fill the red circle with red
    {
            fillCircle(XRED, Circle_Y, Circle_Size, ST7735_BLACK);
            fillCircle(XYEL, Circle_Y, Circle_Size, ST7735_YELLOW);
            fillCircle(XGRN, Circle_Y, Circle_Size, ST7735_BLACK); 
            drawCircle(XRED, Circle_Y, Circle_Size, ST7735_RED);            
            drawCircle(XYEL, Circle_Y, Circle_Size, ST7735_YELLOW);
            drawCircle(XGRN, Circle_Y, Circle_Size, ST7735_GREEN);  
    }
}

void update_LCD_count(char direction, char count)
{
   switch (direction)                       
   {
      case NS:       
        NS_Count[0] = count/10  + '0';
        NS_Count[1] = count%10  + '0';
        drawtext(XCNT, NS_Count_Y, NS_Count, NS_Color, ST7735_BLACK, TS_2); 
        break;
      
    // put code here
        case EW:       
        EW_Count[0] = count/10  + '0';
        EW_Count[1] = count%10  + '0';
        drawtext(XCNT, EW_Count_Y, EW_Count, EW_Color, ST7735_BLACK, TS_2); 
        break;
        
        case EWLT:       
        EWLT_Count[0] = count/10  + '0';
        EWLT_Count[1] = count%10  + '0';
        drawtext(XCNT, EWLT_Count_Y, EWLT_Count, EWLT_Color, ST7735_BLACK, TS_2); 
        break;
        
        case NSLT:       
        NSLT_Count[0] = count/10  + '0';
        NSLT_Count[1] = count%10  + '0';
        drawtext(XCNT, NSLT_Count_Y, NSLT_Count, NSLT_Color, ST7735_BLACK, TS_2); 
        break;
      
    // put code here
    }  
}

void update_LCD_PED_Count(char direction, char count)
{

   switch (direction)
   {
      case NS:       
        PED_NS_Count[0] = count/10  + '0';          // PED count upper digit
        PED_NS_Count[1] = count%10  + '0';          // PED Lower
        drawtext(PED_Count_X, PED_NS_Count_Y, PED_NS_Count, NS_Color, ST7735_BLACK, TS_2);         // Put counter digit on screen
        break;
      
      // put code here  
        case EW:       
        PED_EW_Count[0] = count/10  + '0';          // PED count upper digit
        PED_EW_Count[1] = count%10  + '0';          // PED Lower
        drawtext(PED_Count_X, PED_EW_Count_Y, PED_EW_Count, EW_Color, ST7735_BLACK, TS_2);         // Put counter digit on screen
        break;
      // put code here  

